       Identification Division.                                         00010000
       Program-ID. F115L050.                                            00020000
       Author.  Rune Mesel.                                             00030000
      *################################################################*00040000
      *                                                                 00050000
      * FD Trade Finance                                                00060000
      *                                                                 00070000
      *    The module do initial checks before business logic           00080000
      *    can be processed                                             00090000
      *                                                                 00100000
      *################################################################*00110000
      * Date ! Si! Change description                            ! 3A ! 00120000
      *------+---+-----------------------------------------------+----+ 00130000
      *010399!RM ! New module                                    !LG10! 00140000
      *################################################################*00150000
       Environment Division.                                            00160000
       Configuration Section.                                           00170000
       Special-Names.                                                   00180000
           Decimal-Point Is Comma.                                      00190000
      *                                                                 00200000
      *################################################################*00210000
       Data Division.                                                   00220000
       Working-Storage Section.                                         00230000
      *                                                                 00240000
       01  Filler.                                                      00250000
      *                                                                 00260000
           05  Ws-Table-Version          Pic  X(16).                    00270000
           05  W-IO-Length               Pic S9(04)              Comp.  00280000
           05  Ws-Code-Count             Pic S9(05)              Comp.  00290000
           05  Ws-Sys-Type               Pic  X(20).                    00300000
           05  Ws-Status                 Pic  X(20).                    00310000
      *                                                                 00320000
           05  WD-Length                 Pic  Z.ZZ9.                    00330000
      *                                                                 00340000
      *----------------------------------------------------------------*00350000
      * Internal area:                                                  00360000
      *                                                                 00370000
       01  W-Int-IO-Area.                                               00380000
           Copy R115L050.                                               00390000
      *                                                                 00400000
      *----------------------------------------------------------------*00410000
      * Assorted copy-areas:                                            00420000
      *                                                                 00430000
       01  Filler.                                                      00440000
           Copy R7918030.                                               00450000
       01  Filler.                                                      00460000
           COPY R791I020.                                               00470000
       01  Filler.                                                      00480000
           COPY R115ISC0.                                               00490000
       01  Filler.                                                      00500000
           COPY R115IMC0.                                               00510000
       01  Filler.                                                      00520000
           COPY R115ICA0.                                               00530000
       01  Filler.                                                      00540000
           COPY R115ISR0.                                               00550000
       01  Filler.                                                      00560000
           COPY R115IPA0.                                               00570000
       01  Filler.                                                      00580000
           COPY R115IST0.                                               00590000
      *                                                                 00600000
           Copy R115X000.                                               00610000
      *################################################################.00620000
       Linkage Section.                                                 00630000
      *                                                                 00640000
       01  L-Ext-IO-Area                 Pic  X(560).                   00650000
       Copy R7919999.                                                   00660000
      *                                                                 00670000
      *################################################################.00680000
       Procedure Division                Using L-Ext-IO-Area            00690000
                                               R7919999-Error-Area.     00700000
      *                                                                 00710000
       A000-Main                         Section.                       00720000
      *                                                                 00730000
           Perform B000-Initialize                                      00740000
      *                                                                 00750000
           Perform ZI00-Konv-Input-Version                              00760000
           Perform C000-Interface                                       00770000
           Perform ZO00-Konv-Output-Version                             00780000
      *                                                                 00790000
           Goback.                                                      00800000
      *################################################################*00810000
       B000-Initialize                   Section.                       00820000
      *                                                                 00830000
           Set   R7919999-Return-OK      To    True                     00840000
      *                                                                 00850000
           .                                                            00860000
      *################################################################.00870000
       C000-Interface                    Section.                       00880000
      *                                                                 00890000
      *  Initialize copyareas, and check input                          00900000
      *   - We always have to read Main Contract to get hold of         00910000
      *     the timestamp                                               00920000
      *                                                                 00930000
           Perform C100-Initialize-Output                               00940000
           Move 'ACTUAL'           To Ws-Table-Version                  00950000
           Perform C200-Read-Main-Contract                              00960000
      *                                                                 00970000
           If R115IMC0-In-Progress-Yes                                  00980000
              Move 'WORK'          To Ws-Table-Version                  00990000
              Perform C200-Read-Main-Contract                           01000000
           Else                                                         01010000
              Move 'ACTUAL'        To Ws-Table-Version                  01020000
           End-If                                                       01030000
      *                                                                 01040000
      *                                                                 01050000
           If R115L050-PA-Seq-No         =     +0                       01060000
              Move R115IMC0-Status      To  Ws-Status                   01070000
      *                                                                 01080000
           Else                                                         01090000
              Perform C250-Read-Contract-Amount                         01100000
              Perform C300-Read-Part-Amount                             01110000
              Move R115IPA0-Status      To  Ws-Status                   01120000
      *                                                                 01130000
           End-If                                                       01140000
      *                                                                 01150000
      *  Check that this contract has not been changed since            01160000
      *  this user read the contract information                        01170000
      *                                                                 01180000
      *  Slettet inntil videre for å få gjennom tester i juli. (Nina)   01190000
      *    If   R115L050-Check-For-Upd-Yes                              01200000
      *     and R115L050-Function(3:1) Not = 'R'                        01210000
      *        Perform E000-Check-Upd-Timestamp                         01220000
      *    End-If                                                       01230000
      *                                                                 01240000
      *  Reading to check if this is a valid operation type             01250000
      *                                                                 01260000
           Perform F100-Read-Sys-Code-Rel                               01270000
      *                                                                 01280000
      *  Reading the current STATUS, to return the status properties    01290000
      *                                                                 01300000
           Perform F200-Read-SYS-Code                                   01310000
           Move    R115ISC0-Property    To    R115L050-Cur-Status-Prop  01320000
      *                                                                 01330000
      *  Checking to see if any parameteres will require additional     01340000
      *  tests                                                          01350000
      *                                                                 01360000
           If  R115L050-Function(3:1)     = 'R'                         01370000
           and R115L050-Operation-Type    = 'SHOW'                      01380000
              Continue                                                  01390000
           Else                                                         01400000
              Perform G000-Check-Properties                             01410000
           End-If                                                       01420000
      *                                                                 01430000
           .                                                            01440000
      *################################################################.01450000
       C100-Initialize-Output            Section.                       01460000
      *                                                                 01470000
           Initialize                          R115L050-Data            01480000
      *                                                                 01490000
      **   If   R115L050-Check-For-Upd-Yes                              01500000
      **    and R115L050-Last-Update-TX    = Spaces                     01510000
      **    and R115L050-Function(3:1) Not = 'R'                        01520000
      *                                                                 01530000
      **       Initialize                   R7918030-ErrorMessage       01540000
      **       Move  'TF-SY-UPD-TS-EMPTY'                               01550000
      **                                 To R7918030-In-MessageCode     01560000
      **       Perform Z000-Error-Message                               01570000
      *                                                                 01580000
      **       Move  'C101'              To R7919999-Paragraph          01590000
      **       Perform Z900-Abend                                       01600000
      *                                                                 01610000
      **   End-If                                                       01620000
      *                                                                 01630000
           If   R115L050-Function          = Spaces                     01640000
             or R115L050-Medium            = Spaces                     01650000
      *                                                                 01660000
               Initialize                   R7918030-ErrorMessage       01670000
               Move  'TF-SY-FUNC-AND-MEDIUM'                            01680000
                                         To R7918030-In-MessageCode     01690000
               Perform Z000-Error-Message                               01700000
      *                                                                 01710000
               Move  'C102'              To R7919999-Paragraph          01720000
               Perform Z900-Abend                                       01730000
      *                                                                 01740000
           End-If                                                       01750000
      *                                                                 01760000
           .                                                            01770000
      *################################################################.01780000
       C200-Read-Main-Contract           Section.                       01790000
      *                                                                 01800000
           Initialize                          R115IMC0-Main-Contract   01810000
           Set   R115IMC0-Version        To    True                     01820000
           Move  Ws-Table-Version        To    R115IMC0-In-Table-Version01830000
           Set   R115IMC0-In-Select      To    True                     01840000
      *                                                                 01850000
           Move  R115L050-Fin-Inst-No    To    R115IMC0-In-Fin-Inst-No  01860000
           Move  R115L050-Contr-Type     To    R115IMC0-In-Contract-Type01870000
           Move  R115L050-Contr-No       To    R115IMC0-In-Contract-No  01880000
      *                                                                 01890000
           Call  'F115IMC0'              Using R115IMC0-Main-Contract   01900000
                                               R7919999-Error-Area      01910000
           End-Call                                                     01920000
      *                                                                 01930000
           Evaluate True                                                01940000
             When R7919999-Return-Abend                                 01950000
               Move  'C201'              To    R7919999-Paragraph       01960000
               Perform Z900-Abend                                       01970000
      *                                                                 01980000
             When R7919999-Return-Error                                 01990000
      *                                                                 02000000
                  Set   R115IMC0-In-Work To    True                     02010000
      *                                                                 02020000
                  Call  'F115IMC0'      Using R115IMC0-Main-Contract    02030000
                                              R7919999-Error-Area       02040000
                  End-Call                                              02050000
      *                                                                 02060000
                  Evaluate True                                         02070000
                  When R7919999-Return-Abend                            02080000
                      Move  'C201'        To    R7919999-Paragraph      02090000
                      Perform Z900-Abend                                02100000
      *                                                                 02110000
                  When R7919999-Return-Error                            02120000
                      Move  'C202'        To    R7919999-Paragraph      02130000
                      Perform Z700-Error-AE                             02140000
      *                                                                 02150000
                  End-Evaluate                                          02160000
      *                                                                 02170000
           End-Evaluate                                                 02180000
      *                                                                 02190000
           .                                                            02200000
      *################################################################.02210000
       C250-Read-Contract-Amount         Section.                       02220000
      *                                                                 02230000
           Initialize                          R115ICA0-Contract-Amount 02240000
           Set   R115ICA0-Version        To    True                     02250000
           Move  Ws-Table-Version        To    R115ICA0-In-Table-Version02260000
           Set   R115ICA0-In-Get-1st     To    True                     02270000
           Move  R115L050-Fin-Inst-No    To    R115ICA0-In-Fin-Inst-No  02280000
           Move  R115L050-Contr-Type     To    R115ICA0-In-Contract-Type02290000
           Move  R115L050-Contr-No       To    R115ICA0-In-Contract-No  02300000
      *                                                                 02310000
           Call  'F115ICA0'              Using R115ICA0-Contract-Amount 02320000
                                               R7919999-Error-Area      02330000
           End-Call                                                     02340000
      *                                                                 02350000
           Evaluate True                                                02360000
             When R7919999-Return-Abend                                 02370000
               Move  'G251'              To    R7919999-Paragraph       02380000
               Perform Z900-Abend                                       02390000
      *                                                                 02400000
             When R7919999-Return-Error                                 02410000
               Move  'G252'              To    R7919999-Paragraph       02420000
               Perform Z700-Error-AE                                    02430000
      *                                                                 02440000
           End-Evaluate                                                 02450000
      *                                                                 02460000
           .                                                            02470000
      *################################################################.02480000
       C300-Read-Part-Amount             Section.                       02490000
      *                                                                 02500000
           Initialize                          R115IPA0-Part-Amount     02510000
           Set   R115IPA0-Version        To    True                     02520000
           Move  Ws-Table-Version        To    R115IPA0-In-Table-Version02530000
           Set   R115IPA0-In-Select      To    True                     02540000
      *                                                                 02550000
           Move  R115L050-Fin-Inst-No    To    R115IPA0-In-Fin-Inst-No  02560000
           Move  R115L050-Contr-Type     To    R115IPA0-In-Contract-Type02570000
           Move  R115L050-Contr-No       To    R115IPA0-In-Contract-No  02580000
           Move  R115ICA0-Currency       To    R115IPA0-In-CA-Currency  02590000
           Move  R115L050-PA-Seq-No      To    R115IPA0-In-PA-Seq-No    02600000
      *                                                                 02610000
           Call  'F115IPA0'              Using R115IPA0-Part-Amount     02620000
                                               R7919999-Error-Area      02630000
           End-Call                                                     02640000
      *                                                                 02650000
           Evaluate True                                                02660000
             When R7919999-Return-Error                                 02670000
               Move  'C301'              To    R7919999-Paragraph       02680000
               Perform Z700-Error-AE                                    02690000
      *                                                                 02700000
             When R7919999-Return-Abend                                 02710000
               Move  'C302'              To    R7919999-Paragraph       02720000
               Perform Z900-Abend                                       02730000
      *                                                                 02740000
           End-Evaluate                                                 02750000
      *                                                                 02760000
           .                                                            02770000
      *################################################################.02780000
       E000-Check-Upd-Timestamp          Section.                       02790000
      *                                                                 02800000
           If R115IMC0-Upd-Timestamp Not =  R115L050-Last-Update-TX     02810000
               Initialize                   R7918030-ErrorMessage       02820000
               Move  'TF-SY-UPD-DATED-BY-VAR1'                          02830000
                                         To R7918030-In-MessageCode     02840000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)02850000
               Move  R115IMC0-Upd-User-ID                               02860000
                                         To R7918030-In-Variable-Data(1)02870000
      *                                                                 02880000
               Perform Z000-Error-Message                               02890000
      *                                                                 02900000
               Move  'E001'              To R7919999-Paragraph          02910000
               Perform Z700-Error-AE                                    02920000
      *                                                                 02930000
           End-If                                                       02940000
      *                                                                 02950000
           .                                                            02960000
      *################################################################.02970000
       F100-Read-Sys-Code-Rel            Section.                       02980000
      *                                                                 02990000
           Initialize                          R115ISR0-Sys-Code-Rel    03000000
           Set   R115ISR0-Version        To    True                     03010000
           Set   R115ISR0-In-Select      To    True                     03020000
      *                                                                 03030000
           Move  R115L050-Fin-Inst-No    To  R115ISR0-In-F-I-No         03040000
      *                                                                 03050000
           Move  'STATUS'                To  R115ISR0-In-From-ST-Type   03060000
           Move  Ws-Status               To  R115ISR0-In-From-SC-Code   03070000
      *                                                                 03080000
           Move  R115ISR0-In-From-ST-Type  To  Ws-Sys-Type              03090000
           Perform F300-Les-SYS-Type                                    03100000
           If    R115IST0-Contr-Type-Split-Yes                          03110000
              Move  R115L050-Contr-Type  To  R115ISR0-In-From-Contr-Type03120000
           End-If                                                       03130000
           Move  'OPERATION-TYPE'        To  R115ISR0-In-To-ST-Type     03140000
           Move  R115L050-Operation-Type To  R115ISR0-In-To-SC-Code     03150000
      *                                                                 03160000
           Move  R115ISR0-In-To-ST-Type  To  Ws-Sys-Type                03170000
           Perform F300-Les-SYS-Type                                    03180000
      *                                                                 03190000
           If    R115IST0-Contr-Type-Split-Yes                          03200000
              Move  R115L050-Contr-Type  To  R115ISR0-In-To-Contr-Type  03210000
           End-If                                                       03220000
      *                                                                 03230000
           Move  'VALID-ST-OP'           To    R115ISR0-In-Relation-Type03240000
      *                                                                 03250000
           Call  'F115ISR0'              Using R115ISR0-Sys-Code-Rel    03260000
                                               R7919999-Error-Area      03270000
           End-Call                                                     03280000
      *                                                                 03290000
           Evaluate True                                                03300000
             When R7919999-Return-Abend                                 03310000
               Move  'F101'              To    R7919999-Paragraph       03320000
               Perform Z900-Abend                                       03330000
      *                                                                 03340000
             When R7919999-Return-Error                                 03350000
               Initialize                   R7918030-ErrorMessage       03360000
               Move  'TF-SY-INVALID-STATUS-OPERTYP'                     03370000
                                         To R7918030-In-MessageCode     03380000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03390000
               Move  R115L050-Operation-Type                            03400000
                                         To R7918030-In-Variable-Data(1)03410000
               Move  'VAR2'              To R7918030-In-Variable-Key (2)03420000
               Move  Ws-Status                                          03430000
                                         To R7918030-In-Variable-Data(2)03440000
      *                                                                 03450000
               Perform Z000-Error-Message                               03460000
      *                                                                 03470000
               Move  'F102'              To R7919999-Paragraph          03480000
               Perform Z700-Error-AE                                    03490000
      *                                                                 03500000
           End-Evaluate                                                 03510000
      *                                                                 03520000
           .                                                            03530000
      *################################################################.03540000
       F200-Read-SYS-Code                Section.                       03550000
      *                                                                 03560000
           Initialize                          R115ISC0-Sys-Code        03570000
           Set   R115ISC0-Version        To    True                     03580000
           Set   R115ISC0-In-Select      To    True                     03590000
           Move  'STATUS'                To    R115ISC0-In-ST-Type      03600000
           Move  R115L050-Fin-Inst-No    To    R115ISC0-In-Fin-Inst-No  03610000
           Move  Ws-Status               To    R115ISC0-In-SC-Code      03620000
      *                                                                 03630000
           Move  R115ISC0-In-ST-Type     To    Ws-Sys-Type              03640000
           Perform F300-Les-SYS-Type                                    03650000
           If    R115IST0-Contr-Type-Split-Yes                          03660000
              Move  R115L050-Contr-Type  To    R115ISC0-In-Contr-Type   03670000
           End-If                                                       03680000
      *                                                                 03690000
           Call  'F115ISC0'              Using R115ISC0-Sys-Code        03700000
                                               R7919999-Error-Area      03710000
           End-Call                                                     03720000
      *                                                                 03730000
           Evaluate True                                                03740000
             When R7919999-Return-Abend                                 03750000
               Move  'F201'              To    R7919999-Paragraph       03760000
               Perform Z900-Abend                                       03770000
      *                                                                 03780000
             When R7919999-Return-Error                                 03790000
               Move  'F202'              To    R7919999-Paragraph       03800000
               Perform Z700-Error-AE                                    03810000
      *                                                                 03820000
           End-Evaluate                                                 03830000
      *                                                                 03840000
           .                                                            03850000
      *################################################################.03860000
       F300-Les-SYS-Type                 Section.                       03870000
      *                                                                 03880000
           Initialize                          R115IST0-Sys-Type        03890000
           Set   R115IST0-Version        To    True                     03900000
           Set   R115IST0-In-Select      To    True                     03910000
           Move  Ws-Sys-Type             To    R115IST0-In-ST-Type      03920000
      *                                                                 03930000
           Call  'F115IST0'              Using R115IST0-Sys-Type        03940000
                                               R7919999-Error-Area      03950000
           End-Call                                                     03960000
      *                                                                 03970000
           Evaluate True                                                03980000
             When Not R7919999-Return-OK                                03990000
               Move  'F301'              To    R7919999-Paragraph       04000000
               Perform Z900-Abend                                       04010000
      *                                                                 04020000
           End-Evaluate                                                 04030000
      *                                                                 04040000
           .                                                            04050000
      *################################################################.04060000
       G000-Check-Properties             Section.                       04070000
      *                                                                 04080000
      * Checking to se if the string PERMANENT is in PROPERTIES         04090000
      * If this is the case we have a permanent STATUS                  04100000
      *                                                                 04110000
           Move +0                       To    Ws-Code-Count            04120000
           Inspect  R115ISC0-Property                                   04130000
                    Tallying    Ws-Code-Count                           04140000
                    For  All   'PERM'                                   04150000
      *                                                                 04160000
      * If this STATUS is a permanent one, and IN-Progress = Y          04170000
      * we will not be allowed to contine                               04180000
      *                                                                 04190000
           If   Ws-Code-Count  >  +0                                    04200000
            and R115IMC0-In-Progress-Yes                                04210000
            and R115L050-Function     Not = 'TFD05'                     04220000
      *                                                                 04230000
               Initialize                   R7918030-ErrorMessage       04240000
               Move  'TF-SY-MC-INPROG-Y'                                04250000
                                         To R7918030-In-MessageCode     04260000
      *                                                                 04270000
               Perform Z000-Error-Message                               04280000
               Move  'G001'              To R7919999-Paragraph          04290000
               Perform Z700-Error-AE                                    04300000
      *                                                                 04310000
           End-If                                                       04320000
      *                                                                 04330000
           .                                                            04340000
      *################################################################*04350000
       Z000-Error-Message                Section.                       04360000
      *                                                                 04370000
           Set   R7918030-Version        To    True                     04380000
      *                                                                 04390000
           Move  'TF'                    To    R7918030-In-System-ID    04400000
           Move  R115X000-Fin-Inst-No    To    R7918030-In-Fin-Inst-No  04410000
           Move  R115X000-FI-Language-639-1                             04420000
                                         To    R7918030-In-Language     04430000
      *                                                                 04440000
           If  R115X000-Trace-On                                        04450000
               Set  R7918030-In-Log-Yes  To    True                     04460000
           End-If                                                       04470000
      *                                                                 04480000
           Call  'F7918030'              Using R7918030-ErrorMessage    04490000
           End-Call                                                     04500000
      *                                                                 04510000
           Move  R7918030-Out-MessageText                               04520000
                                         To    R7919999-Message         04530000
      *                                                                 04540000
           .                                                            04550000
      *################################################################*04560000
       ZI00-Konv-Input-Version           Section.                       04570000
      *                                                                 04580000
      * Version control.                                                04590000
      * If conversion is needed, we call the conversion module.         04600000
      *                                                                 04610000
           Set   R115L050-Version        To    True                     04620000
           Move  Length                  Of    R115L050-Initial-Check   04630000
                                         To    W-IO-Length              04640000
      *                                                                 04650000
           Evaluate True                                                04660000
             When L-Ext-IO-Area (1:8)    =     R115L050-Version-No      04670000
             and  Length                 Of    L-Ext-IO-Area            04680000
                                         Not < W-IO-Length              04690000
               Move  L-Ext-IO-Area (1:W-IO-Length)                      04700000
                                         To    W-Int-IO-Area            04710000
      *                                                                 04720000
             When Other                                                 04730000
               Call  'F115L999'                                         04740000
                   Using By Content      'F115L050 '                    04750000
                                         'INPUT '                       04760000
                         By Reference    L-Ext-IO-Area                  04770000
                                         W-Int-IO-Area                  04780000
                                         R7919999-Error-Area            04790000
               End-Call                                                 04800000
      *                                                                 04810000
               If  R7919999-Return-Abend                                04820000
                   Move  'ZI03'          To    R7919999-Paragraph       04830000
                   Perform Z900-Abend                                   04840000
               End-If                                                   04850000
      *                                                                 04860000
           End-Evaluate                                                 04870000
      *                                                                 04880000
           .                                                            04890000
      *################################################################*04900000
       ZO00-Konv-Output-Version          Section.                       04910000
      *                                                                 04920000
      * Version control.                                                04930000
      * If conversion is needed, we call the conversion module.         04940000
      *                                                                 04950000
           Evaluate True                                                04960000
             When L-Ext-IO-Area (1:8)    =     R115L050-Version-No      04970000
             and  Length                 Of    L-Ext-IO-Area            04980000
                                         Not < W-IO-Length              04990000
               Move  W-Int-IO-Area       To    L-Ext-IO-Area            05000000
                                                         (1:W-IO-Length)05010000
      *                                                                 05020000
             When Other                                                 05030000
               Call  'F115L999'                                         05040000
                   Using By Content      'F115L050 '                    05050000
                                         'OUTPUT '                      05060000
                         By Reference    L-Ext-IO-Area                  05070000
                                         W-Int-IO-Area                  05080000
                                         R7919999-Error-Area            05090000
               End-Call                                                 05100000
      *                                                                 05110000
               If  R7919999-Return-Abend                                05120000
                   Move  'ZO01'          To    R7919999-Paragraph       05130000
                   Perform Z900-Abend                                   05140000
               End-If                                                   05150000
      *                                                                 05160000
           End-Evaluate                                                 05170000
      *                                                                 05180000
           .                                                            05190000
      *################################################################*05200000
       Z700-Error-AE                     Section.                       05210000
      *                                                                 05220000
           If  R7919999-Return-Code      Not   Numeric                  05230000
           or  Not R7919999-Return-Abend                                05240000
               Move  +0                  To    R7919999-Module-Ind      05250000
           End-If                                                       05260000
      *                                                                 05270000
           Add   +1                      To    R7919999-Module-Ind      05280000
      *                                                                 05290000
           If  R7919999-Module-Ind       Not >                          05300000
                             ( Length    Of    R7919999-Module-Tab      05310000
                             / Length    Of    R7919999-Module-Element )05320000
               Move  'F115L050'          To    R7919999-Module-Name     05330000
                                                   (R7919999-Module-Ind)05340000
               Move  R7919999-Paragraph  To    R7919999-Module-Para     05350000
                                                   (R7919999-Module-Ind)05360000
           End-If                                                       05370000
      *                                                                 05380000
           Set   R7919999-Return-Error   To    TRUE                     05390000
      *                                                                 05400000
           Goback.                                                      05410000
      *################################################################*05420000
       Z900-Abend                        Section.                       05430000
      *                                                                 05440000
           If  R7919999-Return-Code      Not   Numeric                  05450000
           or  Not R7919999-Return-Abend                                05460000
               Move  +0                  To    R7919999-Module-Ind      05470000
           End-If                                                       05480000
      *                                                                 05490000
           Add   +1                      To    R7919999-Module-Ind      05500000
      *                                                                 05510000
           If  R7919999-Module-Ind       Not >                          05520000
                             ( Length    Of    R7919999-Module-Tab      05530000
                             / Length    Of    R7919999-Module-Element )05540000
               Move  'F115L050'          To    R7919999-Module-Name     05550000
                                                   (R7919999-Module-Ind)05560000
               Move  R7919999-Paragraph  To    R7919999-Module-Para     05570000
                                                   (R7919999-Module-Ind)05580000
           End-If                                                       05590000
      *                                                                 05600000
           Set   R7919999-Return-Abend   To    TRUE                     05610000
      *                                                                 05620000
           Goback.                                                      05630000
