      *################################################################*00010000
      *                                                                 00020000
      * Copy-område R791904W.                                           00030000
      * Generell submodul for validering av dato.                       00040000
      *                                                                 00050000
      * Felter til Working-Storage.                                     00060000
      *                                                                 00070000
      * Kan benyttes sammen med R791904P dersom man ønsker å unngå kall.00080000
      *                                                                 00090000
      * Krever i tilfelle også copy-områdene                            00100004
      *   - R791905W og R791905P.                                       00110004
      *   - R791906W og R791906P.                                       00120004
      *                                                                 00130001
      *################################################################*00140000
      * DATO ! SI! ENDRINGENS ART                                ! 3A ! 00150000
      *---------------------------------------------------------------- 00160000
      *130195!HLR! Nytt copy-område                              !JR68! 00170000
      *################################################################*00180000
       01  F7919040-Arbeids-Felter.                                     00190000
      *                                                                 00200000
           05  W9040-Display-Dato        Pic  9999.99.99.               00210004
      *                                                                 00220000
           05  W9040-Split-Dato          Pic  9(08).                    00230000
           05  Filler                    Redefines W9040-Split-Dato.    00240000
               10  W9040-SD-Aar          Pic  9(04).                    00250000
               10  W9040-SD-Mnd          Pic  9(02).                    00260000
               10  W9040-SD-Dag          Pic  9(02).                    00270000
      *                                                                 00280000
