      *################################################################*00010000
      *                                                                 00020000
      * Copy-område R791TRAC.                                           00030000
      * Generell interface for å logge trace informasjon.               00040000
      *                                                                 00050000
      *                                                                 00060000
      *################################################################*00070000
      * DATO ! SI! ENDRINGENS ART                                ! 3A ! 00080000
      *---------------------------------------------------------------- 00090000
      *091197!JPK! Nytt copy-område                              !    ! 00100000
      *################################################################*00110000
       01  R791TRAC-Interface.                                          00120000
      *                                                                 00130000
           05  R791TRAC-Versjons-Nr      Pic  X(08).                    00140000
      *      88  R791TRAC-Versjon                   Value '19971109'.   00150003
             88  R791TRAC-Versjon                   Value '20050131'.   00151003
      *---------------------------------------------------------------  00160000
      *                                                                 00170000
           05  R791TRAC-Kvalifisering.                                  00180000
      *-----------------------------------------------------------------00190000
      *                                                                 00200000
      *                                                                 00210000
             10  R791TRAC-In-Program     Pic  x(08) Value spaces.       00220000
             10  R791TRAC-In-Sysid       Pic  x(02) Value spaces.       00230000
             10  R791TRAC-In-Trace-Point Pic  x(32) Value spaces.       00240002
             10  R791TRAC-In-Trace-Area  Pic  x(32) Value spaces.       00250002
             10  R791TRAC-In-Trace-Queue Pic  X(48) Value spaces.       00251003
      *-----------------------------------------------------------------00260000
      *                                                                 00270000
      *                                                                 00280000
             10  R791TRAC-In-Trace-Data  Pic  x(32768) Value Spaces.    00290000
