      *################################################################*00010000
      *                                                                 00020000
      * Copy-område R791906W.                                           00030000
      * Generell submodul for å avgjøre om det er skuddår eller ikke.   00040000
      *                                                                 00050000
      * Felter til Working-Storage.                                     00060000
      *                                                                 00070000
      * Kan benyttes sammen med R791906P dersom man ønsker å unngå kall.00080000
      *                                                                 00090000
      *################################################################*00100000
      * DATO ! SI! ENDRINGENS ART                                ! 3A ! 00110000
      *---------------------------------------------------------------- 00120000
      *130195!HLR! Nytt copy-område                              !JR68! 00130000
      *################################################################*00140000
       01  F7919060-Arbeids-Felter.                                     00150000
      *                                                                 00160000
           05  W9060-Split-Dato          Pic  9(08).                    00170000
           05  Filler                    Redefines W9060-Split-Dato.    00180000
               10  W9060-SD-Aar          Pic  9(04).                    00190000
               10  W9060-SD-Mnd          Pic  9(02).                    00200000
               10  W9060-SD-Dag          Pic  9(02).                    00210000
      *                                                                 00220000
           05  W9060-Aar-400             Pic S9(04)              Comp.  00230000
           05  W9060-Aar-100             Pic S9(04)              Comp.  00240000
           05  W9060-Aar-4               Pic S9(04)              Comp.  00250000
      *                                                                 00260000
