      *################################################################*00010000
      *                                                                 00020000
      * Copy-område R791927G.                                           00030000
      *                                                                 00040000
      * Generell submodul for å konvertere mellom timestamp-formater.   00050000
      *                                                                 00060000
      * Her ligger gamle versjoner av copy-området, på grunn av         00070000
      * versjonshåndtering.                                             00080000
      * Vi skal konvertere til og fra ny layout.                        00090000
      *                                                                 00100000
      * Ved innleggelse av "gammel" versjon:                            00110000
      *  - Lag nytt 01-nivå                                             00120000
      *  - Kopier inn copy-området før dette endres                     00130000
      *                                                                 00140000
      *################################################################*00150000
       01  F7919270-Versjon-19961210.                                   00160001
      *                                                                 00164301
           05  R7919270-VERSJONS-NR      PIC  X(08).                    00164401
             88  R7919270-VERSJON                   VALUE '19961210'.   00164501
      *                                                                 00164601
      *----------------------------------------------------------------*00164701
      * Eksempel på DB2 timestamp: 1996-09-11-10.31.04.841276           00164801
      *                                                                 00164901
           05  R7919270-KVALIFISERING.                                  00165001
      *                                                                 00165101
      * Man kan fylle ut enten -In-Dato og -In-Tid-TMS/-TMSH...         00165201
      * (Mikro-sekunder kan fylles ut, men er ikke nødvendig.)          00165301
      *                                                                 00165401
             10  R7919270-IN-DATO        PIC S9(09)              COMP-3.00165501
             10  R7919270-IN-TID-TMS     PIC S9(07)              COMP-3.00165601
             10  R7919270-IN-TID-TMSH    PIC S9(09)              COMP-3.00165701
             10  R7919270-IN-MIKRO-SEK   PIC S9(07)              COMP-3.00165801
      *                                                                 00165901
      * ...eller -In-Timestamp...                                       00166001
      *                                                                 00166101
             10  R7919270-IN-TIMESTAMP   PIC S9(16)              COMP.  00166201
      *                                                                 00166301
      * ...eller -In-Timestamp-DB2.                                     00166401
      *                                                                 00166501
             10  R7919270-IN-TIMESTAMP-DB2                              00166601
                                         PIC  X(26).                    00166701
      *                                                                 00166801
      *----------------------------------------------------------------*00166901
      *                                                                 00167001
           05  R7919270-RESULTAT.                                       00167101
      *                                                                 00167201
      * Alle ut-felter vil være utfylt ved retur.                       00167301
      * (Med forbehold om mikro-sekunder, det avhenger av input'en.)    00167401
      *                                                                 00167501
             10  R7919270-UT-DATO        PIC S9(09)              COMP-3.00167601
             10  R7919270-UT-TID-TMS     PIC S9(07)              COMP-3.00167701
             10  R7919270-UT-TID-TMSH    PIC S9(07)              COMP-3.00167801
             10  R7919270-UT-MIKRO-SEK   PIC S9(07)              COMP-3.00167901
      *                                                                 00168001
             10  R7919270-UT-TIMESTAMP   PIC S9(16)              COMP.  00168101
      *                                                                 00168201
             10  R7919270-UT-TIMESTAMP-DB2                              00168301
                                         PIC  X(26).                    00168401
      *                                                                 00168501
      *=================================================================00168601
      *                                                                 00168701
       01  F7919270-Versjon-19951231.                                   00169001
      *                                                                 00170000
           05  R7919270-VERSJONS-NR      PIC  X(08).                    00180000
             88  R7919270-VERSJON                   VALUE '19951231'.   00190000
      *                                                                 00200000
      *----------------------------------------------------------------*00210000
      * Eksempel på DB2 timestamp: 1996-09-11-10.31.04.841276           00220000
      *                                                                 00230000
           05  R7919270-KVALIFISERING.                                  00240000
      *                                                                 00250000
      * Man kan fylle ut enten -In-Dato og -In-Tid-TMS/-TMSH...         00260000
      * (Mikro-sekunder kan fylles ut, men er ikke nødvendig.)          00270000
      *                                                                 00280000
             10  R7919270-IN-DATO        PIC S9(09)              COMP-3.00290000
             10  R7919270-IN-TID-TMS     PIC S9(07)              COMP-3.00300000
             10  R7919270-IN-TID-TMSH    PIC S9(09)              COMP-3.00310000
             10  R7919270-IN-MIKRO-SEK   PIC S9(07)              COMP-3.00320000
      *                                                                 00330000
      * ...eller -In-Timestamp...                                       00340000
      *                                                                 00350000
             10  R7919270-IN-TIMESTAMP   PIC S9(16)              COMP.  00360000
      *                                                                 00370000
      * ...eller -In-Timestamp-DB2.                                     00380000
      *                                                                 00390000
             10  R7919270-IN-TIMESTAMP-DB2                              00400000
                                         PIC  X(26).                    00410000
      *                                                                 00420000
      *----------------------------------------------------------------*00430000
      *                                                                 00440000
           05  R7919270-RESULTAT.                                       00450000
      *                                                                 00460000
      * Alle ut-felter vil være utfylt ved retur.                       00470000
      * (Med forbehold om mikro-sekunder, det avhenger av input'en.)    00480000
      *                                                                 00490000
             10  R7919270-UT-DATO        PIC S9(09)              COMP-3.00500000
             10  R7919270-UT-TID-TMS     PIC S9(07)              COMP-3.00510000
             10  R7919270-UT-TID-TMSH    PIC S9(09)              COMP-3.00520000
             10  R7919270-UT-MIKRO-SEK   PIC S9(07)              COMP-3.00530000
      *                                                                 00540000
             10  R7919270-UT-TIMESTAMP   PIC S9(16)              COMP.  00550000
      *                                                                 00560000
             10  R7919270-UT-TIMESTAMP-DB2                              00570000
                                         PIC  X(26).                    00580000
      *                                                                 00590000
